var colorFindMa = {
    'red': ['01', '02', '07', '08', 12, 13, 18, 19, 23, 24, 29, 30, 34, 35, 40, 45, 46],
    'blue': ['03', '04', '09', 10, 14, 15, 20, 26, 25, 31, 36, 37, 41, 42, 47, 48],
    'green': ['05', '06', 11, 16, 17, 21, 22, 27, 28, 32, 33, 38, 39, 43, 44, 49]
};
var maFindXiao2020 = ['', '鼠', '猪', '狗', '鸡', '猴', '羊', '马', '蛇', '龙', '兔', '虎', '牛', '鼠', '猪', '狗', '鸡', '猴', '羊', '马', '蛇', '龙', '兔', '虎', '牛', '鼠', '猪', '狗', '鸡', '猴', '羊', '马', '蛇', '龙', '兔', '虎', '牛', '鼠', '猪', '狗', '鸡', '猴', '羊', '马', '蛇', '龙', '兔', '虎', '牛', '鼠'];
var maFindXiao2021 = ['', '牛', '鼠', '猪', '狗', '鸡', '猴', '羊', '马', '蛇', '龙', '兔', '虎', '牛', '鼠', '猪', '狗', '鸡', '猴', '羊', '马', '蛇', '龙', '兔', '虎', '牛', '鼠', '猪', '狗', '鸡', '猴', '羊', '马', '蛇', '龙', '兔', '虎', '牛', '鼠', '猪', '狗', '鸡', '猴', '羊', '马', '蛇', '龙', '兔', '虎', '牛'];
var maFindXiao2022 = ['', '虎', '牛', '鼠', '猪', '狗', '鸡', '猴', '羊', '马', '蛇', '龙', '兔', '虎', '牛', '鼠', '猪', '狗', '鸡', '猴', '羊', '马', '蛇', '龙', '兔', '虎', '牛', '鼠', '猪', '狗', '鸡', '猴', '羊', '马', '蛇', '龙', '兔', '虎', '牛', '鼠', '猪', '狗', '鸡', '猴', '羊', '马', '蛇', '龙', '兔', '虎'];
var maFindXiao2023 = ['', '兔', '虎', '牛', '鼠', '猪', '狗', '鸡', '猴', '羊', '马', '蛇', '龙', '兔', '虎', '牛', '鼠', '猪', '狗', '鸡', '猴', '羊', '马', '蛇', '龙', '兔', '虎', '牛', '鼠', '猪', '狗', '鸡', '猴', '羊', '马', '蛇', '龙', '兔', '虎', '牛', '鼠', '猪', '狗', '鸡', '猴', '羊', '马', '蛇', '龙', '兔'];
var maFindXiao2024 = ['', '龙', '兔', '虎', '牛', '鼠', '猪', '狗', '鸡', '猴', '羊', '马', '蛇', '龙', '兔', '虎', '牛', '鼠', '猪', '狗', '鸡', '猴', '羊', '马', '蛇', '龙', '兔', '虎', '牛', '鼠', '猪', '狗', '鸡', '猴', '羊', '马', '蛇', '龙', '兔', '虎', '牛', '鼠', '猪', '狗', '鸡', '猴', '羊', '马', '蛇', '龙'];
var maFindXiao2025 = ['', '蛇', '龙', '兔', '虎', '牛', '鼠', '猪', '狗', '鸡', '猴', '羊', '马', '蛇', '龙', '兔', '虎', '牛', '鼠', '猪', '狗', '鸡', '猴', '羊', '马', '蛇', '龙', '兔', '虎', '牛', '鼠', '猪', '狗', '鸡', '猴', '羊', '马', '蛇', '龙', '兔', '虎', '牛', '鼠', '猪', '狗', '鸡', '猴', '羊', '马', '蛇', '龙'];
var maFindXiao2026 = ['', '马', '蛇', '龙', '兔', '虎', '牛', '鼠', '猪', '狗', '鸡', '猴', '羊', '马', '蛇', '龙', '兔', '虎', '牛', '鼠', '猪', '狗', '鸡', '猴', '羊', '马', '蛇', '龙', '兔', '虎', '牛', '鼠', '猪', '狗', '鸡', '猴', '羊', '马', '蛇', '龙', '兔', '虎', '牛', '鼠', '猪', '狗', '鸡', '猴', '羊', '马', '蛇', '龙'];
var maFindXiao2027 = ['', '羊', '马', '蛇', '龙', '兔', '虎', '牛', '鼠', '猪', '狗', '鸡', '猴', '羊', '马', '蛇', '龙', '兔', '虎', '牛', '鼠', '猪', '狗', '鸡', '猴', '羊', '马', '蛇', '龙', '兔', '虎', '牛', '鼠', '猪', '狗', '鸡', '猴', '羊', '马', '蛇', '龙', '兔', '虎', '牛', '鼠', '猪', '狗', '鸡', '猴', '羊', '马', '蛇', '龙'];
var maFindXiao2028 = ['', '猴', '羊', '马', '蛇', '龙', '兔', '虎', '牛', '鼠', '猪', '狗', '鸡', '猴', '羊', '马', '蛇', '龙', '兔', '虎', '牛', '鼠', '猪', '狗', '鸡', '猴', '羊', '马', '蛇', '龙', '兔', '虎', '牛', '鼠', '猪', '狗', '鸡', '猴', '羊', '马', '蛇', '龙', '兔', '虎', '牛', '鼠', '猪', '狗', '鸡', '猴', '羊', '马', '蛇', '龙'];
                          //year, month, day, hours, minutes, seconds, milliseconds 分别表示年、月、日、时、分、秒、毫秒。
var demarcationPoint = new Date(2021, 1, 12, 21, 22, 0, 0).getTime();
var demarcationPoint2022 = new Date(2022, 1, 1, 21, 22, 0, 0).getTime();
var demarcationPoint2023 = new Date(2023, 0, 22, 21, 22, 0, 0).getTime();
var demarcationPoint2024 = new Date(2024, 1, 10, 00, 22, 0, 0).getTime();
var demarcationPoint2025 = new Date(2025, 0, 29, 00, 22, 0, 0).getTime();
var demarcationPoint2026 = new Date(2026, 1, 17, 00, 22, 0, 0).getTime();
var demarcationPoint2027 = new Date(2027, 1, 6, 00, 22, 0, 0).getTime();
var demarcationPoint2028 = new Date(2028, 0, 26, 00, 22, 0, 0).getTime();

function maFindXiao(time) {
    var timePiont = time ? new Date(time.replace(/-/g, '/')).getTime() : new Date().getTime();
    if (timePiont > demarcationPoint2028) {
        return maFindXiao2028;
    } else if (timePiont > demarcationPoint2027) {
        return maFindXiao2027;
    } else if (timePiont > demarcationPoint2026) {
        return maFindXiao2026;
    } else if (timePiont > demarcationPoint2025) {
        return maFindXiao2025;
    } else if (timePiont > demarcationPoint2024) {
        return maFindXiao2024;
    } else if (timePiont > demarcationPoint2023) {
        return maFindXiao2023;
    } else if (timePiont > demarcationPoint2022) {
        return maFindXiao2022;
    } else if (timePiont > demarcationPoint) {
        return maFindXiao2021;
    } else {
        return maFindXiao2020;
    }
}